tap "anchordotdev/tap"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "leoafarias/fvm"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "songstitch/anchor"

brew "bat"
brew "btop"
brew "cask"
brew "cava"
brew "cbonsai"
brew "node"
brew "claude-cmd"
brew "cmatrix"
brew "cowsay"
brew "docker"
brew "fzf"
brew "gcc"
brew "gemini-cli"
brew "gh"
brew "git"
brew "jq"
brew "lazygit"
brew "lua-language-server"
brew "neofetch"
brew "neovim"
brew "neovide"
brew "node"
brew "nvm"
brew "ollama"
brew "ripgrep"
brew "opencode"
brew "openjdk"
brew "pipx"
brew "pnpm"
brew "prettier"
brew "protobuf"
brew "slides"
brew "stylua"
brew "superfile"
brew "tailwindcss-language-server"
brew "tmux"
brew "tree"
brew "typescript-language-server"
brew "uv"
brew "wget"
brew "yazi"
brew "z"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

brew "felixkratz/formulae/sketchybar"
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "leoafarias/fvm/fvm"
brew "oven-sh/bun/bun"

cask "alfred"
cask "android-studio"
cask "arc"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "cursor"
cask "cursor-cli"
cask "docker-desktop"
cask "fliqlo"
cask "flutter"
cask "google-chrome"
cask "iterm2"
cask "keyboardcleantool"
cask "linear-linear"
cask "minecraft"
cask "notion"
cask "notion-calendar"
cask "notion-mail"
cask "numi"
cask "obsidian"
cask "ollama-app"
cask "rectangle"
cask "slack"
cask "steam"
cask "telegram"
cask "tradingview"
cask "warp"
cask "webull"

uv "specify-cli"
