# Homebrew packages - maintain with: brew bundle
# Install: brew bundle --file=Brewfile
# Dump current: brew bundle dump --file=Brewfile --force

tap "koekeishiya/formulae"

# CLI tools
brew "bat"
brew "btop"
brew "cava"
brew "docker"
brew "fd"
brew "fvm"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "goose"
brew "jq"
brew "lazygit"
brew "mockery"
brew "neofetch"
brew "neovim"
brew "neovide"
brew "node"
brew "nvm"
brew "ollama"
brew "pnpm"
brew "pyenv"
brew "ripgrep"
brew "skhd"
brew "solidity"
brew "superfile"
brew "stylua"
brew "tmux"
brew "uv"
brew "yabai"
brew "yazi"
brew "yarn"
brew "z"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# GUI apps (casks)
cask "alfred"
cask "android-studio"
cask "arc"
cask "aws-vpn-client"
cask "brave-browser"
cask "claude-code"
cask "cursor"
cask "cursor-cli"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "flutter"
cask "fork"
cask "google-chrome"
cask "iterm2"
cask "keyboardcleantool"
cask "minecraft"
cask "notion"
cask "notion-calendar"
cask "notion-mail"
cask "numi"
cask "obsidian"
cask "ollama-app"
cask "postman"
cask "rectangle"
cask "slack"
cask "telegram"
cask "tradingview"
cask "visual-studio-code"
cask "warp"
cask "webull"
cask "zed"
cask "zen"

